[
    {
        "title": "Wednesday's big stock stories: What's likely to move the market in the next trading session",
        "summary": "CNBC's Stocks @ Night is a daily newsletter delivered after hours, giving you a first look at tomorrow and last look at today. Here's what CNBC TV's producers were watching as stocks rebounded on Tuesday.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.8266000151634216,
        "url": "https://www.cnbc.com/2024/10/08/wednesdays-big-stock-stories-whats-likely-to-move-the-market.html",
        "date": "20241008T234957"
    },
    {
        "title": "Ceylon Graphite Provides Default Status Report",
        "summary": "Ceylon Graphite Corp. (TSX-V: CYL) (OTC: CYLYF) (FSE: CCY) is providing this default status report in accordance with National Policy 12-203 – Management Cease Trade Orders. On July 30, 2024, the Company announced that it was not in a position to file its audited financial statements, CEO and CFO certifications, and management discussion and analysis (the “Annual Filings”) for the year ended March 31, 2024 on or before July 29, 2024.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9985116124153137,
        "url": "https://www.globenewswire.com/news-release/2024/10/08/2960186/0/en/Ceylon-Graphite-Provides-Default-Status-Report.html",
        "date": "20241008T233400"
    },
    {
        "title": "Artificial Intelligence  ( AI )  Market Size in Automotive Anticipated to Exceed USD 13.0 Billion by 2034, with a CAGR of 15.6%: Transparency Market Research Inc.",
        "summary": "The global artificial intelligence (AI) market in automotive is estimated to thrive at a CAGR of 15.6% from 2024 to 2034. A significant driver is the rise of edge computing in automotive AI applications. The emergence of AI-powered cybersecurity solutions is gaining traction in the automotive sector.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9988884329795837,
        "url": "https://www.benzinga.com/pressreleases/24/10/g41241812/artificial-intelligence-ai-market-size-in-automotive-anticipated-to-exceed-usd-13-0-billion-by-203",
        "date": "20241008T233000"
    },
    {
        "title": "TRILLIUM ACQUISITION CORP. ANNOUNCES SECURED LOAN RELATED TO BUSINESS COMBINDATION AGREEMENT",
        "summary": "Trillium is a capital pool company created pursuant to the policies of the TSX Venture Exchange (the \"TSXV\") It has not commenced commercial operations and has no assets other than cash. The Company intends to provide Bankview 1827 Investment Corp. with a secured loan in the amount of $225,000. The Loan shall bear the prime interest rate of the Royal Bank of Canada per annum.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9898108243942261,
        "url": "https://www.benzinga.com/pressreleases/24/10/n41241768/trillium-acquisition-corp-announces-secured-loan-related-to-business-combindation-agreement",
        "date": "20241008T231800"
    },
    {
        "title": "Global Uranium Files Preliminary Base Shelf Prospectus",
        "summary": "Global Uranium Corp. focuses on exploring and developing uranium assets primarily in North America. The Company currently holds seven key uranium projects: the Wing Lake Property in the Mudjatik Domain of Northern Saskatchewan, Canada.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9866049885749817,
        "url": "https://www.globenewswire.com/news-release/2024/10/08/2960184/0/en/Global-Uranium-Files-Preliminary-Base-Shelf-Prospectus.html",
        "date": "20241008T231200"
    },
    {
        "title": "Ethereum Mobile Game 'Guild of Guardians' Reveals First Expansion",
        "summary": "Ethereum Mobile Game 'Guild of Guardians' Reveals First Expansion. $62,124.00 Carbuncle$2,438.80 Carbuncle$580.25 Carbuncle$143.37 Carbuncle$0.999751.730 Carbuncle$1.530703.730. Carbuncle $2,560.67 Carbuncle$7.98 Carbuncle$10.82 Carbuncle$328.93 Carbuncle$4.10 Carbuncle$5.99 Carbuncle $1.056.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9637581706047058,
        "url": "https://decrypt.co/285183/guild-of-guardians-game-expansion",
        "date": "20241008T230204"
    },
    {
        "title": "Guild of Guardians Cools Things Off with New Legendary Guardians, Gameplay Updates, and Worlds to Explore in Frostmire Expansion",
        "summary": "Frostmire will introduce players to a brand new snowy locale, rife with new dungeons and lore, as well as two new Legendary Guardians to add to their rosters. The expansion will introduce Level 7 equipment and gear that can be used to outfit Guardians to provide additional benefits during gameplay and strengthen players' squads.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9992465972900391,
        "url": "https://www.benzinga.com/pressreleases/24/10/n41241568/guild-of-guardians-cools-things-off-with-new-legendary-guardians-gameplay-updates-and-worlds-to-ex",
        "date": "20241008T230000"
    },
    {
        "title": "Generac CEO says pressure on the power grid 'is only going to get worse' from weather and technology",
        "summary": "The pressure on the power grid is only going to increase, Aaron Jagdfeld, CEO of generator company Generac, told CNBC. The increased demand for technology like artificial intelligence and electric vehicles will continue to weigh on the grid, he said.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9831128716468811,
        "url": "https://www.cnbc.com/2024/10/08/generac-ceo-says-pressure-on-the-power-grid-only-going-to-get-worse.html",
        "date": "20241008T225531"
    },
    {
        "title": "Jim Cramer looks at Amazon and Apple and why it can be tough to sit on good stocks",
        "summary": "CNBC's Jim Cramer explains why it can be difficult for investors to sit on solid stocks. Cramer recapped action in the stocks of Apple and Amazon, which received downgrades on Monday. He said bulls ignore downside risks and bears ignore opportunities.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9969354867935181,
        "url": "https://www.cnbc.com/2024/10/08/jim-cramer-amazon-apple.html",
        "date": "20241008T225211"
    },
    {
        "title": "Zealand Pharma provides U.S. regulatory update on dasiglucagon in congenital hyperinsulinism",
        "summary": "Zealand Pharma provides U.S. regulatory update on dasiglucagon in congenital hyperinsulinism. Zealand Pharma A/S (Nasdaq: ZEAL) is a biotechnology company focused on the discovery and development of innovative peptide-based medicines.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.794487714767456,
        "url": "https://www.globenewswire.com/news-release/2024/10/08/2960183/0/en/Zealand-Pharma-provides-U-S-regulatory-update-on-dasiglucagon-in-congenital-hyperinsulinism.html",
        "date": "20241008T224500"
    },
    {
        "title": "Nvidia Stock Rallied  ( Again )  Today and Is Near a New All-Time High. Is the Stock Still a Buy?",
        "summary": "N Nvidia (NVDA 4.05%) stock has started off October with a bang. After suffering through an epic meltdown over the summer, things are beginning to look up. CEO Jensen Huang said the demand for Nvidia's next-generation AI architecture is \"insane\"",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.7220975160598755,
        "url": "https://www.fool.com/investing/2024/10/08/nvidia-stock-rallied-all-time-high-ai-buy/",
        "date": "20241008T224100"
    },
    {
        "title": "Why Investors Were Hot on Oracle Stock Today",
        "summary": "Oracle could become a significant partner of one of the most important AI companies on the scene. If these discussions are occurring, they are at an early stage, and investors should not pile into Oracle stock on that basis alone.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.990267813205719,
        "url": "https://www.fool.com/investing/2024/10/08/why-investors-were-hot-on-oracle-stock-today/",
        "date": "20241008T223830"
    },
    {
        "title": "Investor Notice: Robbins LLP Informs Stockholders of the Class Action Lawsuit Filed Against Iris Energy Limited - Iris Energy  ( NASDAQ:IREN ) ",
        "summary": " Robbins LLP is Investigating Allegations that Iris Energy Limited (IREN) Misled Investors regarding its Prospects with Data Centers and High-Performance Computing. Shareholders who want to serve as lead plaintiff for the class must submit their application to the court by December 6, 2024. You do not have to participate in the case to be eligible for a recovery.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9882662892341614,
        "url": "https://www.benzinga.com/pressreleases/24/10/g41241297/investor-notice-robbins-llp-informs-stockholders-of-the-class-action-lawsuit-filed-against-iris-en",
        "date": "20241008T223119"
    },
    {
        "title": "Why Soleno Therapeutics Stock Blasted 9% Higher Today",
        "summary": "Soleno Therapeutics (SLNO 9.11%) had some good news to report on the regulatory front on Tuesday. Investors were cheered by this as evidenced by their sending the biotech's stock more than 9% higher in price on the day. The company's Prader-Willi treatment inched closer to FDA approval.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9971931576728821,
        "url": "https://www.fool.com/investing/2024/10/08/why-soleno-therapeutics-stock-blasted-9-higher-tod/",
        "date": "20241008T222900"
    },
    {
        "title": "Investor Notice: Robbins LLP Informs Stockholders of the Class Action Lawsuit Filed Against Elanco Animal Health Incorporated - Elanco Animal Health  ( NYSE:ELAN ) ",
        "summary": "A shareholder filed a class action on behalf of all persons and entities who purchased or otherwise acquired Elanco Animal Health Incorporated securities between November 7, 2023 and June 26, 2024. Elanco is an animal health company that develops, manufactures, and markets products for pets and farm animals.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.7295829057693481,
        "url": "https://www.benzinga.com/pressreleases/24/10/g41241259/investor-notice-robbins-llp-informs-stockholders-of-the-class-action-lawsuit-filed-against-elanco-",
        "date": "20241008T222811"
    },
    {
        "title": "Why Nvidia Stock Popped Again Today",
        "summary": "Shares of Nvidia (NVDA 4.05%) gained for the fifth day in a row. Wall Street continued to up its estimates on the AI chip leader. Foxconn and Nvidia are building Taiwan's largest supercomputer, built on the new Blackwell platform.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.894978940486908,
        "url": "https://www.fool.com/investing/2024/10/08/why-nvidia-stock-popped-again-today/",
        "date": "20241008T222655"
    },
    {
        "title": "Paragon 28 Class Action has Commenced: Johnson Fistel Encourages Shareholders to Reach Out for More Information Regarding a Potential Recovery of Losses - Paragon 28  ( NYSE:FNA ) ",
        "summary": "Johnson Fistel, LLP is a nationally recognized shareholder rights law firm with offices in California, New York, Georgia, and Colorado. Shareholders who incurred losses during the class period, have until November 29, 2024, to move the court to become a lead plaintiff in this action.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9968971014022827,
        "url": "https://www.benzinga.com/pressreleases/24/10/g41241241/paragon-28-class-action-has-commenced-johnson-fistel-encourages-shareholders-to-reach-out-for-more",
        "date": "20241008T222500"
    },
    {
        "title": "In Preparation for Hurricane Milton Landfall, Verizon Offers Relief to Impacted Customers - Verizon Communications  ( NYSE:VZ ) ",
        "summary": "From Oct. 9th to Oct. 23rd, Verizon will waive domestic call, text, and data usage for postpaid consumer and Verizon Small Business customers in the following Florida counties. Any overages for those whose billing cycles have already closed will be automatically credited back.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9950684309005737,
        "url": "https://www.benzinga.com/pressreleases/24/10/g41241232/in-preparation-for-hurricane-milton-landfall-verizon-offers-relief-to-impacted-customers",
        "date": "20241008T222129"
    },
    {
        "title": "In Preparation for Hurricane Milton Landfall, Verizon Offers Relief to Impacted Customers",
        "summary": "From Oct. 9th to Oct. 23rd, Verizon will waive domestic call, text, and data usage for postpaid consumer and Verizon Small Business customers* in the following Florida counties. Any overages for those whose billing cycles have already closed will be automatically credited back.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9947375655174255,
        "url": "https://www.globenewswire.com/news-release/2024/10/08/2960178/0/en/In-Preparation-for-Hurricane-Milton-Landfall-Verizon-Offers-Relief-to-Impacted-Customers.html",
        "date": "20241008T222100"
    },
    {
        "title": "Why Eli Lilly Was Such a Healthy Stock Today",
        "summary": "The Congressional Budget Office (CBO) put a number on one piece of that market's potential. As that figure was large, weight loss drug producer Eli Lilly (LLY 1.70%) saw a nearly 2% bump in its share price in response.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9878830313682556,
        "url": "https://www.fool.com/investing/2024/10/08/why-eli-lilly-was-such-a-healthy-stock-today/",
        "date": "20241008T221603"
    },
    {
        "title": "Why Honeywell Stock Topped the Market on Tuesday",
        "summary": "The company is forging ahead with its long-term goal of becoming leaner and more focused. Honeywell plans to spin off its advanced materials business unit. It is part of a broader effort by management to slim down and become a more focused operation.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.7552085518836975,
        "url": "https://www.fool.com/investing/2024/10/08/why-honeywell-stock-topped-the-market-on-tuesday/",
        "date": "20241008T221539"
    },
    {
        "title": "Pricing of CNH Industrial Capital Canada Ltd. Cdn$300 million notes",
        "summary": "CNH Industrial N.V. (NYSE: CNH) announced that its indirect wholly owned subsidiary, CNH Industrial Capital Canada Ltd., has priced Cdn$300 million in aggregate principal amount of 4.00% notes due April 11, 2028. The notes are being offered on a private placement basis to certain accredited investors in each of the provinces of Canada.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9919854402542114,
        "url": "https://www.globenewswire.com/news-release/2024/10/08/2960176/0/en/Pricing-of-CNH-Industrial-Capital-Canada-Ltd-Cdn-300-million-notes.html",
        "date": "20241008T221500"
    },
    {
        "title": "NOVONIX and ICoNiChem Enter into Collaboration Agreement Focused on Sustainable Cathode Material Feedstock",
        "summary": "NOVONIX and ICoNiChem have been selected for funding under the 2024 Canada-UK critical minerals call for proposals. The 2-year project, with a total budget of CAD $515,686, aims to further improve the sustainability of the NOVONIX all-dry, zero-waste technology.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9017175436019897,
        "url": "https://www.globenewswire.com/news-release/2024/10/08/2960175/0/en/NOVONIX-and-ICoNiChem-Enter-into-Collaboration-Agreement-Focused-on-Sustainable-Cathode-Material-Feedstock.html",
        "date": "20241008T220600"
    },
    {
        "title": "Bitcoin Holders Lock Up $1.4 Billion as Babylon Staking Expands",
        "summary": "Bitcoin Holders Lock Up $1.4 Billion as Babylon Staking Expands. $62,124.00 is the current market value of the Bitcoin network. $2,437.27 is the average price of a single Bitcoin.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9931704998016357,
        "url": "https://decrypt.co/285218/bitcoin-holders-stake-1-4-billion-babylon",
        "date": "20241008T220507"
    },
    {
        "title": "Johnson Fistel Urges WEBTOON Entertainment Inc. Shareholders to Contact the Firm Before the Class Action Deadline to Learn About Their Rights - Webtoon Entertainment  ( NASDAQ:WBTN ) ",
        "summary": "The lawsuit seeks to recover losses on behalf of investors who acquired securities pursuant and/or traceable to the Company's initial public offering conducted in June 2024 (the \"IPO\"). If you wish to serve as lead plaintiff, you must move the Court no later than November 4, 2024.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9930478930473328,
        "url": "https://www.benzinga.com/pressreleases/24/10/g41241031/johnson-fistel-urges-webtoon-entertainment-inc-shareholders-to-contact-the-firm-before-the-class-a",
        "date": "20241008T220000"
    },
    {
        "title": "GM expects 2025 earnings to be similar to this year despite industry headwinds",
        "summary": "GM expects its 2025 adjusted earnings to be in a \"similar range\" to the company's results this year. The Detroit automaker's targeted adjusted earnings before interest and taxes for 2024 were between $13 billion and $15 billion.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9966742992401123,
        "url": "https://www.cnbc.com/2024/10/08/gm-investor-day-2025-earnings.html",
        "date": "20241008T215925"
    },
    {
        "title": "EXCLUSIVE: Cannabis Rescheduling Is Not Cure-All For Industry Problems: Experts Explain How Tax Tactics Could Hurt Marijuana Businesses In Long Run",
        "summary": "Rescheduling is \"not a Panacea to all the problems of the industry,\" says Frank Segall, co-chair of cannabis practice at Blank Rome. The shift of cannabis to Schedule III would not result in big players like Wells Fargo crossing over to the marijuana industry.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9986157417297363,
        "url": "https://www.benzinga.com/markets/cannabis/24/10/41241003/exclusive-cannabis-rescheduling-is-not-cure-all-for-industry-problems-experts-explain-how-tax-ta",
        "date": "20241008T215857"
    },
    {
        "title": "ThreeD Capital Inc. Announces New Investor Relations Agreement - ThreeD Cap  ( OTC:IDKFF ) ",
        "summary": "ThreeD Capital Inc. has entered into an agreement with PHK Investments LLC to provide investor relations services to the Company. PHK will engage with investors through various digital marketing and social media platforms, to facilitate greater investor awareness and widespread dissemination of ThreeD's news.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9943090677261353,
        "url": "https://www.benzinga.com/pressreleases/24/10/g41240973/threed-capital-inc-announces-new-investor-relations-agreement",
        "date": "20241008T215202"
    },
    {
        "title": "ThreeD Capital Inc. Announces New Investor Relations Agreement",
        "summary": "ThreeD Capital Inc. has entered into an agreement with PHK Investments LLC to provide investor relations services to the Company. The services provided by PHK are to commence as of October 8, 2024 and will continue for a 12-month term (resulting in an annual fee of £82,500, approximately $112,275 CAD)",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.5152623057365417,
        "url": "https://www.globenewswire.com/news-release/2024/10/08/2960171/0/en/ThreeD-Capital-Inc-Announces-New-Investor-Relations-Agreement.html",
        "date": "20241008T215200"
    },
    {
        "title": "Merit Medical Systems to Announce Third Quarter 2024 Results on October 30, 2024",
        "summary": "Merit Medical Systems, Inc. (NASDAQ: MMSI) will release its financial results for the quarter ended September 30, 2024. The company will hold its investor conference call on the same day at 5:00 p.m. Eastern. A live webcast and slide deck can be accessed using this link.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.6580227017402649,
        "url": "https://www.globenewswire.com/news-release/2024/10/08/2960170/8028/en/Merit-Medical-Systems-to-Announce-Third-Quarter-2024-Results-on-October-30-2024.html",
        "date": "20241008T214300"
    },
    {
        "title": "United Parks & Resorts Inc. Appoints James Mikolaichik as Chief Financial Officer and Treasurer - United Parks & Resorts  ( NYSE:PRKS ) ",
        "summary": "James \"Jim\" Mikolaichik brings over 30 years of global financial and strategic planning experience to United Parks & Resorts. He replaces Interim Chief Financial Officer James \" Jim\" W. Forrester, Jr., who will remain with the Company through the end of the year to help ensure a smooth transition.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.999535083770752,
        "url": "https://www.benzinga.com/pressreleases/24/10/n41240918/united-parks-resorts-inc-appoints-james-mikolaichik-as-chief-financial-officer-and-treasurer",
        "date": "20241008T214200"
    },
    {
        "title": "Back-To-Back Hurricanes Batter Florida's Insurance Market: Stocks To Watch - Allstate  ( NYSE:ALL ) , Progressive  ( NYSE:PGR ) ",
        "summary": "After Hurricane Helene, losses for private insurers were estimated at $3 to $6 billion. Hurricane Milton is expected to make landfall Wednesday on Florida's Gulf Coast near Tampa. The average annual premium for homeowners' insurance in Florida has surged to $10,996.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9659721255302429,
        "url": "https://www.benzinga.com/markets/equities/24/10/41240852/back-to-back-hurricanes-batter-floridas-insurance-market-stocks-to-watch",
        "date": "20241008T214001"
    },
    {
        "title": "Tradepulse Power Inflow Alert: Honeywell International Inc. Receives Alert And Rises 1.6% During Trading Day - Honeywell Intl  ( NASDAQ:HON ) ",
        "summary": "The Power Inflow occurs within the first two hours of the market open and generally signals the trend that helps gauge the stock’s overall direction, powered by institutional activity in the stock. This particular indicator is interpreted by active traders as a bullish signal. The returns on the High price ($207.58) and Close price (207) are respectively 1.6% and 1.5%.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.962547242641449,
        "url": "https://www.benzinga.com/signals/24/10/41240832/tradepulse-power-inflow-alert-honeywell-international-inc-receives-alert-and-rises-1-6-during-tradin",
        "date": "20241008T213743"
    },
    {
        "title": "Emergent BioSolutions Demonstrates Commitment to Increasing Access & Awareness of NARCAN® Nasal Spray to Help Combat the Opioid Epidemic - Emergent BioSolutions  ( NYSE:EBS ) ",
        "summary": "Emergent BioSolutions Inc. is committed to supporting widespread opioid emergency preparedness. In March 2024, Emergent joined the ‘White House Challenge to Save Lives from Overdose' NARCAN® Nasal Spray is a life-saving medication that can reverse an overdose from opioids, including heroin, fentanyl, and prescription opioid medications.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9809297323226929,
        "url": "https://www.benzinga.com/pressreleases/24/10/g41240775/emergent-biosolutions-demonstrates-commitment-to-increasing-access-awareness-of-narcan-nasal-spray",
        "date": "20241008T213228"
    },
    {
        "title": "Emergent BioSolutions Demonstrates Commitment to Increasing Access & Awareness of NARCAN® Nasal Spray to Help Combat the Opioid Epidemic",
        "summary": "Emergent BioSolutions is working with businesses to prepare for accidental opioid emergencies. In March 2024, Emergent joined the ‘White House Challenge to Save Lives from Overdose’ NARCAN® Nasal Spray is a life-saving medication that can reverse an overdose from opioids.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.8883232474327087,
        "url": "https://www.globenewswire.com/news-release/2024/10/08/2960169/33240/en/Emergent-BioSolutions-Demonstrates-Commitment-to-Increasing-Access-Awareness-of-NARCAN-Nasal-Spray-to-Help-Combat-the-Opioid-Epidemic.html",
        "date": "20241008T213200"
    },
    {
        "title": "If You Invested $1000 In This Stock 10 Years Ago, You Would Have $7,800 Today - T-Mobile US  ( NASDAQ:TMUS ) ",
        "summary": "T-Mobile US TMUS has outperformed the market over the past 10 years by 11.3% on an annualized basis producing an average annual return of 23.11%. If an investor had bought $1000 of TMUS stock 10 years ago, it would be worth $7,844.35 today.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9906060099601746,
        "url": "https://www.benzinga.com/insights/news/24/10/41240747/if-you-invested-1000-in-this-stock-10-years-ago-you-would-have-7-800-today",
        "date": "20241008T213031"
    },
    {
        "title": "Here's How Much $100 Invested In Reliance 5 Years Ago Would Be Worth Today - Reliance  ( NYSE:RS ) ",
        "summary": "Reliance RS has outperformed the market over the past 5 years by 9.06% on an annualized basis. Currently, Reliance has a market capitalization of $15.59 billion. If an investor had bought $100 of RS stock 5 years ago, it would be worth $278.89 today.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9836914539337158,
        "url": "https://www.benzinga.com/insights/news/24/10/41240744/heres-how-much-100-invested-in-reliance-5-years-ago-would-be-worth-today",
        "date": "20241008T213026"
    },
    {
        "title": "Canoe EIT Income Fund Announces 2024 Voluntary Cash Redemption",
        "summary": "The redemption date for the Fund's annual voluntary cash redemption will be December 6, 2024. Unitholders are entitled to redeem units of the Fund at a price equal to 95% of the Average Net Asset Value of the three trading days preceding the redemption date, less direct costs.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.845226526260376,
        "url": "https://www.benzinga.com/pressreleases/24/10/g41240734/canoe-eit-income-fund-announces-2024-voluntary-cash-redemption",
        "date": "20241008T213000"
    },
    {
        "title": "Canoe EIT Income Fund Announces 2024 Voluntary Cash Redemption",
        "summary": "Canoe EIT Income Fund (“Canoe” or the “Fund”)(TSX - EIT.UN) today announced the 2024 voluntary cash redemption. Unitholders are entitled to redeem units of the Fund at a price equal to 95% of the Average Net Asset Value of the three trading days preceding the December 6, 2024 redemption date.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.8460219502449036,
        "url": "https://www.globenewswire.com/news-release/2024/10/08/2960168/0/en/Canoe-EIT-Income-Fund-Announces-2024-Voluntary-Cash-Redemption.html",
        "date": "20241008T213000"
    },
    {
        "title": "ValOre Metals Announces Closing of Upsized $4,100,000 Non-Brokered Private Placement - ValOre Metals  ( OTC:KVLQF ) ",
        "summary": "ValOre issued 55,220,294 units (the \"Units\") at a price of $0.075 per Unit for gross proceeds of $4,141,522.05. The Company intends to use the net proceeds raised from the Offering for exploration on ValOre's 100% owned Pedra Branca Platinum Group Elements Project in northeastern Brazil.Certain directors and officers of the Company participated in the Offered and purchased a total of 42,000,000 Units. Upon purchase of these Units, insider participation will be in excess of 25% of the private placement.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.95247483253479,
        "url": "https://www.benzinga.com/pressreleases/24/10/g41240561/valore-metals-announces-closing-of-upsized-4-100-000-non-brokered-private-placement",
        "date": "20241008T211500"
    },
    {
        "title": "ValOre Metals Announces Closing of Upsized $4,100,000 Non-Brokered Private Placement",
        "summary": "ValOre issued 55,220,294 units (the “Units”) at a price of $0.075 per Unit for gross proceeds of $4,141,522.05. The Company intends to use the net proceeds raised from the Offering for exploration on ValOre’s 100% owned Pedra Branca Platinum Group Elements Project in northeastern Brazil.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9821879267692566,
        "url": "https://www.globenewswire.com/news-release/2024/10/08/2960166/0/en/ValOre-Metals-Announces-Closing-of-Upsized-4-100-000-Non-Brokered-Private-Placement.html",
        "date": "20241008T211500"
    },
    {
        "title": "U.S. Department of Energy Announces Award for HALEU Deconversion - Centrus Energy  ( AMEX:LEU ) ",
        "summary": "American Centrifuge Operating, LLC is one of six awardees. Centrus Energy is a trusted supplier of nuclear fuel and services for the nuclear power industry. Since 1998, the Company has provided its utility customers with more than 1,750 reactor years of fuel, which is equivalent to 7 billion tons of coal.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9978995323181152,
        "url": "https://www.benzinga.com/pressreleases/24/10/n41240563/u-s-department-of-energy-announces-award-for-haleu-deconversion",
        "date": "20241008T211500"
    },
    {
        "title": "Norwood Financial Corp Announces Cash Dividend - Norwood Financial  ( NASDAQ:NWFL ) ",
        "summary": "Norwood Financial Corp, through its subsidiary, Wayne Bank operates fifteen offices in Northeastern Pennsylvania and fourteen offices in Delaware, Sullivan, Ontario, Otsego and Yates Counties, New York. As of June 30, 2024, Norwood had total assets of $2.235 billion. The Company's stock is traded on the Nasdaq Global Market under the symbol \"NWFL\"",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.8805164694786072,
        "url": "https://www.benzinga.com/pressreleases/24/10/g41240444/norwood-financial-corp-announces-cash-dividend",
        "date": "20241008T211020"
    },
    {
        "title": "Norwood Financial Corp Announces Cash Dividend",
        "summary": "Norwood Financial Corp (NASDAQ Global Market - NWFL) and its subsidiary Wayne Bank announced that the Board of Directors has declared a $0.30 per share cash dividend. The dividend is payable November 1, 2024, to shareholders of record as of October 18, 2024. As of June 30, 2024,. Norwood had total assets of $2.235 billion, loans outstanding of $1.641 billion, total deposits of $.811 billion and total capital of $182.2 million.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9305574893951416,
        "url": "https://www.globenewswire.com/news-release/2024/10/08/2960165/20770/en/Norwood-Financial-Corp-Announces-Cash-Dividend.html",
        "date": "20241008T211000"
    },
    {
        "title": "ATN acquires Broadcast rights for American National Cricket League  ( NCL )  2024, followed by West Indies vs England",
        "summary": "Asian Television Network International Limited (ATN) SAT has acquired the Exclusive Canadian rights for the first season of National Cricket League of USA being played in Dallas, Texas. The inaugural season of the NCL kicks off on October 4, 2024 with matches hosted at University of Texas at Dallas (UTD) Cricket Stadium. Teams from major cities such as New York, Chicago, Houston, Los Angeles, and more will compete in this premier tournament.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9971083998680115,
        "url": "https://www.benzinga.com/pressreleases/24/10/n41240430/atn-acquires-broadcast-rights-for-american-national-cricket-league-ncl-2024-followed-by-west-indie",
        "date": "20241008T210800"
    },
    {
        "title": "Shallow High-Grade Uranium Mineralization Expands at Co.'s Project - Baselode Energy  ( OTC:BSENF ) ",
        "summary": "Baselode Energy Corp. has reported positive uranium assay results from three drill holes of the 2024 drill program at its Ackio prospect. The uranium market has experienced notable growth in recent years. Baselode's exploration strategy focuses on near-surface, basement-hosted uranium.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9982940554618835,
        "url": "https://www.benzinga.com/news/24/10/41215709/shallow-high-grade-uranium-mineralization-expands-at-co-s-project",
        "date": "20241008T210517"
    },
    {
        "title": "Silvercorp Renews Mining License at Ying Mining District - Silvercorp Metals  ( AMEX:SVM ) ",
        "summary": "The Yuelianggou Mining License (the \"License\") containing the SGX and HZG silver-lead-zinc mines, located in the western part of the Ying Mining District, has been renewed until September 24, 2035. The Company is working on the mine optimization plan to achieve allowed production capacity of 500,000 tonnes per year.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.8990713357925415,
        "url": "https://www.benzinga.com/pressreleases/24/10/n41240363/silvercorp-renews-mining-license-at-ying-mining-district",
        "date": "20241008T210500"
    },
    {
        "title": "Global Pharma Selects Kneat to Digitize Computer System Validation",
        "summary": "A global pharmaceutical company has signed a three-year Master Services Agreement with Kneat to digitize its validation processes. Headquartered in Germany with over 11,000 employees across more than a dozen facilities, the company is a trusted maker of household consumer health care brands and generic and specialty pharmaceuticals.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9983904361724854,
        "url": "https://www.globenewswire.com/news-release/2024/10/08/2960162/0/en/Global-Pharma-Selects-Kneat-to-Digitize-Computer-System-Validation.html",
        "date": "20241008T210400"
    },
    {
        "title": "Comcast Opens 261,000 Free Xfinity WiFi Hotspots Across Florida Ahead of Hurricane Milton's Arrival - Comcast  ( NASDAQ:CMCSA ) ",
        "summary": "Comcast opened more than 261,000 Xfinity WiFi Hotspots in areas the company serves across Florida. To help residents and emergency personnel stay connected ahead of Hurricane Milton's landfall, the free and public hotspots are now open for anyone to use.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9977273344993591,
        "url": "https://www.benzinga.com/pressreleases/24/10/n41240351/comcast-opens-261-000-free-xfinity-wifi-hotspots-across-florida-ahead-of-hurricane-miltons-arrival",
        "date": "20241008T210400"
    },
    {
        "title": "AstraZeneca Inks Agreement to Boost Cardiovascular Pipeline - Alnylam Pharmaceuticals  ( NASDAQ:ALNY ) , ADMA Biologics  ( NASDAQ:ADMA ) ",
        "summary": "AstraZeneca announced that it has signed an exclusive license agreement with China-based CSPC Pharmaceutical Group Ltd for developing an early-stage, small molecule Lipoprotein (a) (Lp(a) disruptor. The agreement is likely to strengthen AstraZeneca's cardiovascular pipeline, which is being studied for treating various cardiovascular diseases.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9945710301399231,
        "url": "https://www.benzinga.com/general/biotech/24/10/41236941/astrazeneca-inks-agreement-to-boost-cardiovascular-pipeline",
        "date": "20241008T210142"
    },
    {
        "title": "SHAREHOLDER ALERT: Holzer & Holzer, LLC Reminds Investors of the October 15, 2024 Lead Plaintiff Deadline in Class Action Lawsuits Filed on Behalf of Symbotic Inc.  ( SYM ) , Ardelyx, Inc.  ( ARDX ) , PDD Holdings Inc.  ( PDD ) , and Sprinklr, Inc.  ( CXM )  Shareholders - Sprinklr  ( NYSE:CXM ) , Ardelyx  ( NASDAQ:ARDX ) ",
        "summary": "Holzer & Holzer, LLC reminds investors of the October 15, 2024 Lead Plaintiff deadline in the following class action lawsuits. If you bought shares of Symbotic between May 6, 2024 and July 29, 2024, and you suffered a significant loss on that investment, you are encouraged to discuss your legal rights.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.953197717666626,
        "url": "https://www.benzinga.com/pressreleases/24/10/g41240278/shareholder-alert-holzer-holzer-llc-reminds-investors-of-the-october-15-2024-lead-plaintiff-deadli",
        "date": "20241008T210127"
    },
    {
        "title": "NextGen Food Robotics Corp. Provides Bi-Weekly MCTO Status Update",
        "summary": "NextGen Food Robotics Corp. is providing an update in accordance with National Policy 12-203 - Management Cease Trade Orders. The Company applied for a management cease trade order with the British Columbia Securities Commission on August 13, 2024. The MCTO was issued on July 30, 2024 and restricts its Chief Executive Officer and Chief Financial Officer from trading in securities of the Company until the Company files the Required Documents.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9919931888580322,
        "url": "https://www.globenewswire.com/news-release/2024/10/08/2960160/0/en/NextGen-Food-Robotics-Corp-Provides-Bi-Weekly-MCTO-Status-Update.html",
        "date": "20241008T210100"
    },
    {
        "title": "Element to Announce Q3 2024 Results and Host Conference Call on November 14, 2024",
        "summary": "Element Fleet Management Corp. (TSX: EFN) will hold its Q3 2024 results conference call and webcast for investors and analysts on Thursday, November 14, 2024 at 8:00 a.m. Eastern Time. Element’s financial results for the period will be issued after market close on Wednesday, November 13, 2024.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.6352109313011169,
        "url": "https://www.globenewswire.com/news-release/2024/10/08/2960159/0/en/Element-to-Announce-Q3-2024-Results-and-Host-Conference-Call-on-November-14-2024.html",
        "date": "20241008T210100"
    },
    {
        "title": "Here's How Much $100 Invested In Stryker 10 Years Ago Would Be Worth Today - Stryker  ( NYSE:SYK ) ",
        "summary": "Stryker SYK has outperformed the market over the past 10 years by 4.03% on an annualized basis producing an average annual return of 15.84%. If an investor had bought $100 of SYK stock 10 years ago, it would be worth $431.90 today.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9899874329566956,
        "url": "https://www.benzinga.com/insights/news/24/10/41240231/heres-how-much-100-invested-in-stryker-10-years-ago-would-be-worth-today",
        "date": "20241008T210025"
    },
    {
        "title": "$100 Invested In Howmet Aerospace 5 Years Ago Would Be Worth This Much Today - Howmet Aerospace  ( NYSE:HWM ) ",
        "summary": "Howmet Aerospace HWM has outperformed the market over the past 5 years by 23.87% on an annualized basis. If an investor had bought $100 of HWM stock 5 years ago, it would be worth $507.99 today.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.987636923789978,
        "url": "https://www.benzinga.com/insights/news/24/10/41240229/100-invested-in-howmet-aerospace-5-years-ago-would-be-worth-this-much-today",
        "date": "20241008T210020"
    },
    {
        "title": "Osisko Announces Preliminary Q3 2024 GEO Deliveries, Cash Margin and Reduced Debt Balance - Osisko Gold Royalties  ( NYSE:OR ) ",
        "summary": "Osisko recorded preliminary revenues from royalties and streams of $57.3 million during the third quarter. The net debt position as of September 30, 2024 was reduced to $22.2 million following debt repayments of $27.3 million. Osisko's portfolio is anchored by its cornerstone asset, a 3-5% net smelter return royalty on the Canadian Malartic Complex, one of Canada's largest gold mines.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9918549060821533,
        "url": "https://www.benzinga.com/pressreleases/24/10/g41240216/osisko-announces-preliminary-q3-2024-geo-deliveries-cash-margin-and-reduced-debt-balance",
        "date": "20241008T210000"
    },
    {
        "title": "Skyharbour Partner Medaro Mining Announces Exploration Plan for the Yurchison Uranium Project Located in the Athabasca Basin, Saskatchewan",
        "summary": "Skyharbour Resources Ltd. (TSX-V:SYH) (OTCQX: SYHBF) (Frankfurt: SC1P) is pleased to announce its exploration plans for a winter program at its Yurchison Uranium property. The program is anticipated to commence within the next 45 days. The primary goals of the field program will be to determine the hose-rock and/or structural control of previous identified radioactive mineral occurrences.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9881014823913574,
        "url": "https://www.globenewswire.com/news-release/2024/10/08/2960158/36591/en/Skyharbour-Partner-Medaro-Mining-Announces-Exploration-Plan-for-the-Yurchison-Uranium-Project-Located-in-the-Athabasca-Basin-Saskatchewan.html",
        "date": "20241008T210000"
    },
    {
        "title": "CARESPAN HEALTH PROVIDES STRATEGIC BUSINESS UPDATES AND ANNOUNCES LEADERSHIP TRANSITION",
        "summary": "CareSpan Health, Inc. provides an update on recent strategic initiatives and announces a leadership transition. The Company continues to focus on expanding its network of providers performing medical examinations for U.S. military veterans and reservists. The strategic talks with a potential artificial intelligence (\"AI\") partner are ongoing.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.997077226638794,
        "url": "https://www.benzinga.com/pressreleases/24/10/n41240226/carespan-health-provides-strategic-business-updates-and-announces-leadership-transition",
        "date": "20241008T210000"
    },
    {
        "title": "Stride Announces Date for First Quarter Fiscal Year 2025 Earnings Call",
        "summary": "Stride Inc. plans to discuss its first quarter fiscal year 2025 financial results during a conference call scheduled for Tuesday, October 22, 2024 at 5:00 p.m. eastern time (ET) A live webcast of the call will be available at https://events.q4inc.com/attendee/118785460.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.953004002571106,
        "url": "https://www.globenewswire.com/news-release/2024/10/08/2960156/0/en/Stride-Announces-Date-for-First-Quarter-Fiscal-Year-2025-Earnings-Call.html",
        "date": "20241008T210000"
    },
    {
        "title": "Osisko Announces Preliminary Q3 2024 GEO Deliveries, Cash Margin and Reduced Debt Balance",
        "summary": "Osisko recorded preliminary revenues from royalties and streams of $57.3 million during the third quarter and preliminary cost of sales (excluding depletion) of $2.2 million, resulting in a quarterly cash margin2 of approximately $55.1 million (or 96.3%). As at September 30th, 2024, Osisko’s cash position was $58.5 million. The net debt position as of September 30, 2024 was reduced to $22.2m following debt repayments of $27.3m.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9954244494438171,
        "url": "https://www.globenewswire.com/news-release/2024/10/08/2960154/0/en/Osisko-Announces-Preliminary-Q3-2024-GEO-Deliveries-Cash-Margin-and-Reduced-Debt-Balance.html",
        "date": "20241008T210000"
    },
    {
        "title": "Colliers adds leading Australian engineering firm - Colliers Intl Gr  ( NASDAQ:CIGI ) ",
        "summary": "Colliers has acquired TTM Group Pty Limited, a leading transportation engineering consultancy headquartered in Brisbane, Queensland. TTM's senior leadership team will become shareholders in the Colliers Engineering platform under Colliers' unique partnership model. Terms of the transaction were not disclosed.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.838689386844635,
        "url": "https://www.benzinga.com/pressreleases/24/10/g41240214/colliers-adds-leading-australian-engineering-firm",
        "date": "20241008T210000"
    },
    {
        "title": "Colliers adds leading Australian engineering firm",
        "summary": "Colliers Engineering & Design Australia has acquired TTM Group Pty Limited. TTM is a leading transportation engineering consultancy headquartered in Brisbane, Queensland. The addition will augment Colliers Engineering’s overall scale. Terms of the transaction were not disclosed.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9787293672561646,
        "url": "https://www.globenewswire.com/news-release/2024/10/08/2960157/0/en/Colliers-adds-leading-Australian-engineering-firm.html",
        "date": "20241008T210000"
    },
    {
        "title": "Domino's Pizza, Inc. Investors: Please contact the Portnoy Law Firm to recover your losses. November 19, 2024 Deadline to file Lead Plaintiff Motion. - Domino's Pizza  ( NYSE:DPZ ) ",
        "summary": "Investors can contact the law firm at no cost to learn more about recovering their losses. The Portnoy Law Firm represents investors in pursuing claims against caused by corporate wrongdoing. The Firm's founding partner has recovered over $5.5 billion for aggrieved investors.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9490337371826172,
        "url": "https://www.benzinga.com/pressreleases/24/10/g41240203/dominos-pizza-inc-investors-please-contact-the-portnoy-law-firm-to-recover-your-losses-november-19",
        "date": "20241008T205855"
    },
    {
        "title": "Massive Potential: 3 Tech Stocks Positioned for Breakout Success - MicroStrategy  ( NASDAQ:MSTR ) , PTC  ( NASDAQ:PTC ) ",
        "summary": "MicroStrategy Inc. MSTR, SAP SAP, and even PTC Inc. PTC would expose investors to the potential bull runs that could be seen in the cryptocurrency space as interest rate cuts work their way through Bitcoin. These stocks share the same characteristics that the manufacturing PMI index reported in its latest issue.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9959779977798462,
        "url": "https://www.benzinga.com/news/earnings/24/10/41224973/massive-potential-3-tech-stocks-positioned-for-breakout-success",
        "date": "20241008T205636"
    },
    {
        "title": "Bitcoin Bribe Worth $73 Million Lands Russian Investigator 16-Year Prison Sentence",
        "summary": "Bitcoin Bribe Worth $73 Million Lands Russian Investigator 16-Year Prison Sentence. $62,124.00 is the sum of the bribes received by the Russian investigator. $2,437.27 is the amount of the bribe that the investigator received.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9710732102394104,
        "url": "https://decrypt.co/285206/bitcoin-bribe-73-million-russian-investigator",
        "date": "20241008T205421"
    },
    {
        "title": "AMN Stock Down Despite WorkWise Launch to Enhance Healthcare Delivery - AMN Healthcare Services  ( NYSE:AMN ) , Baxter Intl  ( NYSE:BAX ) ",
        "summary": "AMN Healthcare Services, Inc. launched an innovative technology suite, WorkWise, last Wednesday. The suite is expected to unify the company's technologies into one single technology offering. The technology suite will likely empower healthcare systems to efficiently source the appropriate talent, while effectively managing costs.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9987767338752747,
        "url": "https://www.benzinga.com/news/earnings/24/10/41236942/amn-stock-down-despite-workwise-launch-to-enhance-healthcare-delivery",
        "date": "20241008T205103"
    },
    {
        "title": "Coinbase Global, Inc. Investors: Please contact the Portnoy Law Firm to recover your losses. November 12, 2024 Deadline to file Lead Plaintiff Motion - Coinbase Glb  ( NASDAQ:COIN ) ",
        "summary": "Coinbase Global, Inc. (\"Five Below\") COIN investors of a class action representing investors that bought securities between April 14, 2021 and July 25, 2024, inclusive. Investors have until November 12, 2024 to file a lead plaintiff motion.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9602471590042114,
        "url": "https://www.benzinga.com/pressreleases/24/10/g41240065/coinbase-global-inc-investors-please-contact-the-portnoy-law-firm-to-recover-your-losses-november-",
        "date": "20241008T204934"
    },
    {
        "title": "Ardelyx, Inc. Investors: Please contact the Portnoy Law Firm to recover your losses. October 15, 2024 Deadline to file Lead Plaintiff Motion. - Ardelyx  ( NASDAQ:ARDX ) ",
        "summary": "Investors can contact the law firm at no cost to learn more about recovering their losses. The Portnoy Law Firm represents investors in pursuing claims against caused by corporate wrongdoing. The Firm's founding partner has recovered over $5.5 billion for aggrieved investors.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9490337371826172,
        "url": "https://www.benzinga.com/pressreleases/24/10/g41240063/ardelyx-inc-investors-please-contact-the-portnoy-law-firm-to-recover-your-losses-october-15-2024-d",
        "date": "20241008T204853"
    },
    {
        "title": "Astera Labs Stock Jumps After The Bell: What's Happening? - Astera Labs  ( NASDAQ:ALAB ) ",
        "summary": "Astera Labs Inc ALAB shares are trading higher in Tuesday’s after-hours session. Astera Labs introduced a portfolio of switches designed for AI workloads in accelerated computing platforms deployed at cloud-scale. The company is a supplier of connectivity solutions for several tech giants.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.8233819603919983,
        "url": "https://www.benzinga.com/news/24/10/41240051/astera-labs-stock-jumps-after-the-bell-whats-happening",
        "date": "20241008T204822"
    },
    {
        "title": "Three Stocks: Palo Alto Networks, Chipotle Mexican Grill, and Palantir",
        "summary": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block. You can email the site owner to let them know you were blocked.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9980579018592834,
        "url": "https://moneymorning.com/2024/10/08/three-stocks-palo-alto-networks-chipotle-mexican-grill-and-palantir/",
        "date": "20241008T204635"
    },
    {
        "title": "Is Nu Holdings Overvalued or Primed for More Growth? - Nu Holdings  ( NYSE:NU ) ",
        "summary": "Brazilian fintech Nu Holdings Ltd. has only been trading publicly for under three years. It has already managed to accumulate over 100 million customers in Latin America. The company, which offers digital banking solutions without brick-and-mortar locations, has drawn the interest of Warren Buffett.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9968405961990356,
        "url": "https://www.benzinga.com/news/earnings/24/10/41225868/is-nu-holdings-overvalued-or-primed-for-more-growth",
        "date": "20241008T204631"
    },
    {
        "title": "Healthy Returns: What activist Starboard's $1 billion stake means for Pfizer",
        "summary": "Former Pfizer executives are backing a push by activist investor Starboard Value to turn around the struggling company. Starboard has a roughly $1 billion stake in the drugmaker and approached former Pfizer CEO Ian Read and ex-CFO Frank D'Amelio. Pfizer is facing mounting pressure to improve the company's performance after several missteps over the past two years.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9870071411132812,
        "url": "https://www.cnbc.com/2024/10/08/healthy-returns-what-activist-starboards-stake-means-for-pfizer.html",
        "date": "20241008T204617"
    }
]