[
    {
        "title": "Li Auto and GDS Holdings Are Rising Today, While PDD Holdings Is Falling",
        "summary": "Analysts are conflicted on Chinese stocks after an epic run over the past few weeks. The Hang Seng index, which is composed of major Chinese stocks listed in Hong Kong, has now surged 34% over the last month. The question among analysts is whether the rally can continue despite struggles in the Chinese economy.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9941805601119995,
        "url": "https://www.fool.com/investing/2024/10/07/why-li-auto-and-gds-holdings-rose-today-and-pdd-ho/",
        "date": "20241007T155700"
    },
    {
        "title": "SHAREHOLDER INVESTIGATION: Halper Sadeh LLC Investigates CDE, SMC, COFS, RFL on Behalf of Shareholders - Coeur Mining  ( NYSE:CDE ) , ChoiceOne Finl Servs  ( NASDAQ:COFS ) ",
        "summary": "Halper Sadeh LLC, an investor rights law firm, is investigating the following companies for potential violations of the federal securities laws and/or breaches of fiduciary duties. Shareholders are encouraged to contact the firm free of charge to discuss their legal rights and options.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9418424367904663,
        "url": "https://www.benzinga.com/pressreleases/24/10/g41211009/shareholder-investigation-halper-sadeh-llc-investigates-cde-smc-cofs-rfl-on-behalf-of-shareholders",
        "date": "20241007T155507"
    },
    {
        "title": "WISDOMTREE MULTI ASSET ISSUER PUBLIC LIMITED COMPANY  ( a public company incorporated with limited liability in Ireland )  WISDOMTREE S&P 500 VIX SHORT-TERM FUTURES 2.25X DAILY LEVERAGED SECURITIES ISIN: XS2819843736",
        "summary": "WisdomTree Multi Asset Issuer Public Limited Company (the “Issuer”) wishes to announce that the Extraordinary Resolution regarding the reduction in the principal amount of the WisdomTree S&P 500 VIX Short-Term Futures 2.25x Daily Leveraged Securities was passed at an adjourned meeting of the holders of the Affected Securities. The Deed of Amendment has been duly executed by the Issuer, the Manager and the Trustee.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9898566007614136,
        "url": "https://www.globenewswire.com/news-release/2024/10/07/2959141/0/en/WISDOMTREE-MULTI-ASSET-ISSUER-PUBLIC-LIMITED-COMPANY-a-public-company-incorporated-with-limited-liability-in-Ireland-WISDOMTREE-S-P-500-VIX-SHORT-TERM-FUTURES-2-25X-DAILY-LEVERAGED.html",
        "date": "20241007T155500"
    },
    {
        "title": "Dalian Wanda Digs Its Way Out Of Rubble Of Failed Property Management IPO",
        "summary": "Zhuhai Wanda originally planned to raise up to HK$30 billion ($3.86 billion) in a Hong Kong listing. The plan crumbled with the tanking of China real estate market. Dalian Wanda agreed to repurchase nearly 108 million ZhuhaiWanda shares from Country Garden Services.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9995608925819397,
        "url": "https://www.benzinga.com/24/10/41210994/dalian-wanda-digs-its-way-out-of-rubble-of-failed-property-management-ipo",
        "date": "20241007T155428"
    },
    {
        "title": "Barnes To Go Private In $3.6B Acquisition Deal With Apollo - Barnes Gr  ( NYSE:B ) ",
        "summary": "Barnes Group, Inc. B shares are trading higher after the company inked a deal to be acquired by funds managed by affiliates of Apollo Global Management. The agreement stipulates that Barnes shareholders will receive $47.50 per share in cash.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.7573124766349792,
        "url": "https://www.benzinga.com/markets/equities/24/10/41210983/barnes-to-go-private-in-3-6b-acquisition-deal-with-apollo",
        "date": "20241007T155400"
    },
    {
        "title": "Why Air Products & Chemicals Is Floating Higher Today",
        "summary": "Activist firm Mantle Ridge has amassed a more than $1 billion stake in Air Products & Chemicals. As of 11 a.m. ET Monday, Air Products shares were up by 8% from Friday's close. Air Products distributes essential gases to industrial and medical users.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.517964243888855,
        "url": "https://www.fool.com/investing/2024/10/07/why-air-products-chemicals-is-floating-higher-toda/",
        "date": "20241007T155112"
    },
    {
        "title": "Moo Deng Knockoff Skyrockets as Ethereum Creator Vitalik Buterin Sells 10 Billion Tokens",
        "summary": "Moo Deng Knockoff Skyrockets as Ethereum Creator Vitalik Buterin Sells 10 Billion tokens. Moo Deng is the co-founder of the Chinese social networking site Moo.com.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9888727068901062,
        "url": "https://decrypt.co/284917/moo-deng-ethereum-vitalik-buterin",
        "date": "20241007T155038"
    },
    {
        "title": "These EV Stocks Are Tumbling With No End in Sight",
        "summary": "The electric vehicle market has been on a wild ride for the last few months. Demand for electric vehicles (EVs) has been disappointing, trade barriers are going up around the world, and a rush of planned stimulus spending in China changed the market's tune last week. Lucid, Luminar, and ChargePoint all have significant debt loads, so debt markets might not be open to them.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9917929768562317,
        "url": "https://www.fool.com/investing/2024/10/07/electric-vehicle-stocks-are-tumbling-with-no-end-i/",
        "date": "20241007T155021"
    },
    {
        "title": "Jeff Cohen Joins Guggenheim Securities to Expand Consumer & Retail Investment Banking",
        "summary": "Jeff Cohen brings more than 30 years of investment banking experience to Guggenheim. Mr. Cohen most recently served as a Senior Advisor at UBS in the Retail Investment Banking group. He previously held the position of Global Head of Retail Investment banking at Lazard, UBS, and Wasserstein Perella/Dresdner Kleinwort Wasserenstein.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9994426369667053,
        "url": "https://www.benzinga.com/pressreleases/24/10/g41210921/jeff-cohen-joins-guggenheim-securities-to-expand-consumer-retail-investment-banking",
        "date": "20241007T154921"
    },
    {
        "title": "Reddit Stock Faces Caution from JP Morgan: Strong Fundamentals, But Valuation Concerns Persist - Reddit  ( NYSE:RDDT ) ",
        "summary": "JP Morgan analyst Doug Anmuth maintained a Neutral rating on Reddit, Inc RDDT with a price target of $77, up from $59. He updated Reddit estimates ahead of third-quarter results to reflect recent positive trends.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9473181366920471,
        "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/10/41210911/reddit-stock-faces-caution-from-jp-morgan-strong-fundamentals-but-valuation-concern",
        "date": "20241007T154840"
    },
    {
        "title": "Ferrellgas Marks National Propane Day, Supports Communities Following Hurricane Helene",
        "summary": "Ferrellgas and its tank exchange brand, Blue Rhino, are providing the propane currently powering homes, businesses, and generators in parts of the southeast following Hurricane Helene. “We pride ourselves on treating our customers like family,” said President and CEO Tamria Zertuche.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9989759922027588,
        "url": "https://www.globenewswire.com/news-release/2024/10/07/2959134/31028/en/Ferrellgas-Marks-National-Propane-Day-Supports-Communities-Following-Hurricane-Helene.html",
        "date": "20241007T154800"
    },
    {
        "title": "Wood Coatings Market Size Projected to Surge to USD 30.1 Billion by 2034, Growing at an 8.5% CAGR: Transparency Market Research",
        "summary": "The wood coatings industry generated a value of US$ 12.3 billion in 2023. A CAGR of 8.5% is expected between 2024 and 2034, and it is expected to reach US$ 30.1 billion by 2034. New curing technologies are becoming popular, especially UV and waterborne UV.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.968271791934967,
        "url": "https://www.benzinga.com/pressreleases/24/10/g41210902/wood-coatings-market-size-projected-to-surge-to-usd-30-1-billion-by-2034-growing-at-an-8-5-cagr-tr",
        "date": "20241007T154757"
    },
    {
        "title": "The GIST and The Professional Women's Hockey League  ( PWHL )  Team Up To Create Fan-First Content and Further Amplify Women's Sports",
        "summary": "The GIST and the Professional Women's Hockey League (PWHL) have announced an official alliance in the spirit of sport. The GIST is joining forces with the PWHL to pair its fan-first content with the league's access and momentum. The two organizations will work together to provide brands with a 360 co-package partnership.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.999119222164154,
        "url": "https://www.benzinga.com/pressreleases/24/10/n41210897/the-gist-and-the-professional-womens-hockey-league-pwhl-team-up-to-create-fan-first-content-and-fu",
        "date": "20241007T154700"
    },
    {
        "title": "How Is The Market Feeling About American Superconductor? - American Superconductor  ( NASDAQ:AMSC ) ",
        "summary": "American Superconductor's AMSC short percent of float has risen 3.0% since its last report. The company recently reported that it has 2.64 million shares sold short, which is 7.2% of all regular shares available for trading.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9929143190383911,
        "url": "https://www.benzinga.com/insights/short-sellers/24/10/41210855/how-is-the-market-feeling-about-american-superconductor",
        "date": "20241007T154526"
    },
    {
        "title": " ( PH )  - Analyzing Parker Hannifin's Short Interest - Parker Hannifin  ( NYSE:PH ) ",
        "summary": "Parker Hannifin's PH short percent of float has risen 7.14% since its last report. The company recently reported that it has 1.16 million shares sold short, which is 0.9% of all regular shares that are available for trading.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9914790987968445,
        "url": "https://www.benzinga.com/insights/short-sellers/24/10/41210848/ph-analyzing-parker-hannifins-short-interest",
        "date": "20241007T154521"
    },
    {
        "title": " ( KEY )  - Analyzing KeyCorp's Short Interest - KeyCorp  ( NYSE:KEY ) ",
        "summary": "KeyCorp's KEY short percent of float has fallen 22.41% since its last report. Short selling is when a trader sells shares of a company they do not own, with the hope that the price will fall. An increase in short interest can signal that investors have become more bearish.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9990690350532532,
        "url": "https://www.benzinga.com/insights/short-sellers/24/10/41210846/key-analyzing-keycorps-short-interest",
        "date": "20241007T154516"
    },
    {
        "title": "Sila Realty Trust Praised For 'Lowest Financial Leverage' And Diversified Portfolio - Sila Realty Trust  ( NYSE:SILA ) ",
        "summary": "Shares of Sila Realty Trust Inc SILA gained on Monday following a positive analyst outlook, which highlighted optimism about the stock’s potential. The stock, which was listed on the NYSE on June 13, is likely to provide attractive risk-adjusted returns over the next 12 months.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9989990592002869,
        "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/10/41210845/sila-realty-trust-praised-for-lowest-financial-leverage-and-diversified-portfolio",
        "date": "20241007T154512"
    },
    {
        "title": "Syensqo - Acquisition of own shares",
        "summary": "Syensqo SA announces that it has repurchased 600 of its own shares. As of 04 October 2024, the Company held a total of 1,518,264 own shares, spread out as follows.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9297340512275696,
        "url": "https://www.globenewswire.com/news-release/2024/10/07/2959131/0/en/Syensqo-Acquisition-of-own-shares.html",
        "date": "20241007T154500"
    },
    {
        "title": "VINCI has reached an agreement for the acquisition of RH Marine and Bakker Sliedrecht in the Netherlands",
        "summary": "VINCI has reached an agreement for the acquisition of RH Marine and Bakker Sliedrecht in the Netherlands. VINCI Energies generated a total revenue of €19.3 billion in 2023 through its network of 2,000 business units in 61 countries.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.994148850440979,
        "url": "https://www.globenewswire.com/news-release/2024/10/07/2959132/0/en/VINCI-has-reached-an-agreement-for-the-acquisition-of-RH-Marine-and-Bakker-Sliedrecht-in-the-Netherlands.html",
        "date": "20241007T154500"
    },
    {
        "title": "KLÉPIERRE : INFORMATION REGARDING THE TOTAL VOTING RIGHTS AND SHARES OF KLÉPIERRE SA AS OF SEPTEMBER 30, 2024",
        "summary": "Klépierre is the premier shopping malls specialist with an exclusive focus on continental Europe. The Company’s portfolio is valued at €19.9 billion at June 30, 2024. Klépierre holds a controlling stake in Steen & Strøm (56.1%)",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9982506632804871,
        "url": "https://www.globenewswire.com/news-release/2024/10/07/2959128/0/en/KL%C3%89PIERRE-INFORMATION-REGARDING-THE-TOTAL-VOTING-RIGHTS-AND-SHARES-OF-KL%C3%89PIERRE-SA-AS-OF-SEPTEMBER-30-2024.html",
        "date": "20241007T154500"
    },
    {
        "title": "Dominica Announces 2024 World Creole Music Festival: Nightly Lineup, Tickets, and Sponsors",
        "summary": "The 24th annual World Creole Music Festival will take place in Dominica from October 25th to 27th, 2024. The festival will showcase a mix of performances from local, regional and international artists.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9995356798171997,
        "url": "https://www.benzinga.com/pressreleases/24/10/n41210844/dominica-announces-2024-world-creole-music-festival-nightly-lineup-tickets-and-sponsors",
        "date": "20241007T154400"
    },
    {
        "title": "Huntress Earns #1 Ranking for Endpoint Detection and Response  ( EDR )  in CRN's 2024 Annual Report Card",
        "summary": "Huntress solution providers ranked the company number one in endpoint detection and response in CRN's 2024 Annual Report Card. Huntress' managed Identity Threat Detection and Response (formerly MDR for Microsoft 365) was ranked in the top two.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9873764514923096,
        "url": "https://www.benzinga.com/pressreleases/24/10/g41210835/huntress-earns-1-ranking-for-endpoint-detection-and-response-edr-in-crns-2024-annual-report-card",
        "date": "20241007T154349"
    },
    {
        "title": "Why This Westrock Coffee Analyst Is Bullish About The Strategic Shift To Ready-To-Drink Beverages - Westrock Coffee  ( NASDAQ:WEST ) ",
        "summary": "Shares of Westrock Coffee Co WEST came under pressure in early trading on Monday. The company is well positioned for margin expansion with the build out of its new facility in Conway, Arkansas. Extracts and RTDs can generate 4x to 5x of the margins generated by roast and ground coffee.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9887190461158752,
        "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/10/41210793/why-this-westrock-coffee-analyst-is-bullish-about-the-strategic-shift-to-ready-to-d",
        "date": "20241007T154318"
    },
    {
        "title": "Increased Load Factors and Strong On-Time Performance",
        "summary": "Play airlines carried 144,746 passengers in September 2024, a 14.7% decrease compared to last year when 163,784 passengers were flown. The load factor increased, rising from 85.0% in September 2023 to 87.3% this year. PLAY launched ticket sales for scheduled flights to Valencia, Spain, and Pula, Croatia.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9891272187232971,
        "url": "https://www.globenewswire.com/news-release/2024/10/07/2959125/0/en/Increased-Load-Factors-and-Strong-On-Time-Performance.html",
        "date": "20241007T154300"
    },
    {
        "title": "Oil Surges On 1-Year Hamas Attack Anniversary As Israel Mulls Iran Retaliation - United States Oil Fund  ( ARCA:USO ) ",
        "summary": "Oil prices continue their ascent, marking the strongest five-day rally in two years. The recent escalation in the region, combined with heightened concerns about potential Israeli retaliation against Iran, has pushed crude oil up by more than 11% over the last five sessions.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.9932505488395691,
        "url": "https://www.benzinga.com/etfs/specialty-etfs/24/10/41210761/oil-surges-on-1-year-hamas-attack-anniversary-as-israel-mulls-iran-retaliation",
        "date": "20241007T154214"
    },
    {
        "title": "Ethan Allen's Western North Carolina Distribution Center Begins Recovery Process Following Hurricane Helene - Ethan Allen Interiors  ( NYSE:ETD ) ",
        "summary": "An Ethan Allen distribution center located in Old Fort, North Carolina, was recently impacted by the significant flooding caused by Hurricane Helene. The distribution center, which primarily focuses on shipping custom-made home furnishings to select wholesale customers, has not yet resumed daily shipping operations due to limited road accessibility for tractor trailers. Recovery efforts have already begun, including restoration of electricity and internet connectivity. Ethan Allen's vertically integrated structure and strong manufacturing base in North America offers the Company the ability to reroute operations.",
        "sentiment_label": "Bullish",
        "sentiment_score": 0.6701674461364746,
        "url": "https://www.benzinga.com/pressreleases/24/10/g41210746/ethan-allens-western-north-carolina-distribution-center-begins-recovery-process-following-hurrican",
        "date": "20241007T154126"
    },
    {
        "title": "Ethan Allen's Western North Carolina Distribution Center Begins Recovery Process Following Hurricane Helene",
        "summary": "The Ethan Allen distribution center in Old Fort, North Carolina, was recently impacted by the significant flooding caused by Hurricane Helene. The distribution center, which primarily focuses on shipping custom-made home furnishings to select wholesale customers, has not yet resumed daily shipping operations. The Company’s major upholstery operations, which are located in central N.C., were not significantly disrupted and are currently operating at normal capacity.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9886117577552795,
        "url": "https://www.globenewswire.com/news-release/2024/10/07/2959123/31475/en/Ethan-Allen-s-Western-North-Carolina-Distribution-Center-Begins-Recovery-Process-Following-Hurricane-Helene.html",
        "date": "20241007T154100"
    },
    {
        "title": "Malta Considers Safe Cannabis Consumption Places, New Legal Forms Of Marijuana And Bans HHC Products",
        "summary": "Malta's cannabis authority is considering establishing places where people can consume cannabis. Under the current law, cannabis use is only allowed in private. The Authority for the Responsible Use of Cannabis (ARUC) is considering on-site consumption.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.8751189112663269,
        "url": "https://www.benzinga.com/markets/cannabis/24/10/41210702/malta-considers-safe-cannabis-consumption-places-new-legal-forms-of-marijuana-and-bans-hhc-produ",
        "date": "20241007T154012"
    },
    {
        "title": "Ageas reports on the progress of share buy-back programme",
        "summary": "Since the start of the share buy-back programme on 16 September 2024, Ageas has bought back 325,461 shares for a total amount of EUR 15,504,294. This corresponds to 0.17% of the total shares outstanding.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9330067038536072,
        "url": "https://www.globenewswire.com/news-release/2024/10/07/2959122/0/en/Ageas-reports-on-the-progress-of-share-buy-back-programme.html",
        "date": "20241007T154000"
    },
    {
        "title": "What's Going On With MYT Netherlands Shares Monday? - MYT Netherlands Parent  ( NYSE:MYTE ) ",
        "summary": "Mytheresa, also known as MYTE, stock is trading higher after it entered into a binding agreement with Richemont to acquire YOOX NET-A-PORTER (YNAP) At the time of writing, Mytheresa stock was trading 20.9% higher at $5.21.",
        "sentiment_label": "Bearish",
        "sentiment_score": -0.9682031273841858,
        "url": "https://www.benzinga.com/news/24/10/41210620/whats-going-on-with-myt-netherlands-shares-monday",
        "date": "20241007T153631"
    }
]